GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k80.inc
// Register: B1CON
#define B1CON B1CON
B1CON                                    equ 0E90h
// bitfield definitions
B1CON_FILHIT0_TXPRI0_POSN                equ 0000h
B1CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B1CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B1CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B1CON_FILHIT0_TXPRI0_MASK                equ 0001h
B1CON_FILHIT1_TXPRI1_POSN                equ 0001h
B1CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B1CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B1CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B1CON_FILHIT1_TXPRI1_MASK                equ 0002h
B1CON_FILHIT2_RTREN_POSN                 equ 0002h
B1CON_FILHIT2_RTREN_POSITION             equ 0002h
B1CON_FILHIT2_RTREN_SIZE                 equ 0001h
B1CON_FILHIT2_RTREN_LENGTH               equ 0001h
B1CON_FILHIT2_RTREN_MASK                 equ 0004h
B1CON_FILHIT3_TXREQ_POSN                 equ 0003h
B1CON_FILHIT3_TXREQ_POSITION             equ 0003h
B1CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B1CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B1CON_FILHIT3_TXREQ_MASK                 equ 0008h
B1CON_FILHIT4_TXERR_POSN                 equ 0004h
B1CON_FILHIT4_TXERR_POSITION             equ 0004h
B1CON_FILHIT4_TXERR_SIZE                 equ 0001h
B1CON_FILHIT4_TXERR_LENGTH               equ 0001h
B1CON_FILHIT4_TXERR_MASK                 equ 0010h
B1CON_RXRTRRO_TXLARB_POSN                equ 0005h
B1CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B1CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B1CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B1CON_RXRTRRO_TXLARB_MASK                equ 0020h
B1CON_RXM1_TXABT_POSN                    equ 0006h
B1CON_RXM1_TXABT_POSITION                equ 0006h
B1CON_RXM1_TXABT_SIZE                    equ 0001h
B1CON_RXM1_TXABT_LENGTH                  equ 0001h
B1CON_RXM1_TXABT_MASK                    equ 0040h
B1CON_RXFUL_TXBIF_POSN                   equ 0007h
B1CON_RXFUL_TXBIF_POSITION               equ 0007h
B1CON_RXFUL_TXBIF_SIZE                   equ 0001h
B1CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B1CON_RXFUL_TXBIF_MASK                   equ 0080h
B1CON_FILHIT0_POSN                       equ 0000h
B1CON_FILHIT0_POSITION                   equ 0000h
B1CON_FILHIT0_SIZE                       equ 0001h
B1CON_FILHIT0_LENGTH                     equ 0001h
B1CON_FILHIT0_MASK                       equ 0001h
B1CON_FILHIT1_POSN                       equ 0001h
B1CON_FILHIT1_POSITION                   equ 0001h
B1CON_FILHIT1_SIZE                       equ 0001h
B1CON_FILHIT1_LENGTH                     equ 0001h
B1CON_FILHIT1_MASK                       equ 0002h
B1CON_FILHIT2_POSN                       equ 0002h
B1CON_FILHIT2_POSITION                   equ 0002h
B1CON_FILHIT2_SIZE                       equ 0001h
B1CON_FILHIT2_LENGTH                     equ 0001h
B1CON_FILHIT2_MASK                       equ 0004h
B1CON_FILHIT3_POSN                       equ 0003h
B1CON_FILHIT3_POSITION                   equ 0003h
B1CON_FILHIT3_SIZE                       equ 0001h
B1CON_FILHIT3_LENGTH                     equ 0001h
B1CON_FILHIT3_MASK                       equ 0008h
B1CON_FILHIT4_POSN                       equ 0004h
B1CON_FILHIT4_POSITION                   equ 0004h
B1CON_FILHIT4_SIZE                       equ 0001h
B1CON_FILHIT4_LENGTH                     equ 0001h
B1CON_FILHIT4_MASK                       equ 0010h
B1CON_RXRTRRO_POSN                       equ 0005h
B1CON_RXRTRRO_POSITION                   equ 0005h
B1CON_RXRTRRO_SIZE                       equ 0001h
B1CON_RXRTRRO_LENGTH                     equ 0001h
B1CON_RXRTRRO_MASK                       equ 0020h
B1CON_RXM1_POSN                          equ 0006h
B1CON_RXM1_POSITION                      equ 0006h
B1CON_RXM1_SIZE                          equ 0001h
B1CON_RXM1_LENGTH                        equ 0001h
B1CON_RXM1_MASK                          equ 0040h
B1CON_RXFUL_POSN                         equ 0007h
B1CON_RXFUL_POSITION                     equ 0007h
B1CON_RXFUL_SIZE                         equ 0001h
B1CON_RXFUL_LENGTH                       equ 0001h
B1CON_RXFUL_MASK                         equ 0080h
B1CON_TXPRI0_POSN                        equ 0000h
B1CON_TXPRI0_POSITION                    equ 0000h
B1CON_TXPRI0_SIZE                        equ 0001h
B1CON_TXPRI0_LENGTH                      equ 0001h
B1CON_TXPRI0_MASK                        equ 0001h
B1CON_TXPRI1_POSN                        equ 0001h
B1CON_TXPRI1_POSITION                    equ 0001h
B1CON_TXPRI1_SIZE                        equ 0001h
B1CON_TXPRI1_LENGTH                      equ 0001h
B1CON_TXPRI1_MASK                        equ 0002h
B1CON_RTREN_POSN                         equ 0002h
B1CON_RTREN_POSITION                     equ 0002h
B1CON_RTREN_SIZE                         equ 0001h
B1CON_RTREN_LENGTH                       equ 0001h
B1CON_RTREN_MASK                         equ 0004h
B1CON_TXREQ_POSN                         equ 0003h
B1CON_TXREQ_POSITION                     equ 0003h
B1CON_TXREQ_SIZE                         equ 0001h
B1CON_TXREQ_LENGTH                       equ 0001h
B1CON_TXREQ_MASK                         equ 0008h
B1CON_TXERR_POSN                         equ 0004h
B1CON_TXERR_POSITION                     equ 0004h
B1CON_TXERR_SIZE                         equ 0001h
B1CON_TXERR_LENGTH                       equ 0001h
B1CON_TXERR_MASK                         equ 0010h
B1CON_TXLARB_POSN                        equ 0005h
B1CON_TXLARB_POSITION                    equ 0005h
B1CON_TXLARB_SIZE                        equ 0001h
B1CON_TXLARB_LENGTH                      equ 0001h
B1CON_TXLARB_MASK                        equ 0020h
B1CON_TXABT_POSN                         equ 0006h
B1CON_TXABT_POSITION                     equ 0006h
B1CON_TXABT_SIZE                         equ 0001h
B1CON_TXABT_LENGTH                       equ 0001h
B1CON_TXABT_MASK                         equ 0040h
B1CON_TXBIF_POSN                         equ 0007h
B1CON_TXBIF_POSITION                     equ 0007h
B1CON_TXBIF_SIZE                         equ 0001h
B1CON_TXBIF_LENGTH                       equ 0001h
B1CON_TXBIF_MASK                         equ 0080h
B1CON_B1FILHIT0_POSN                     equ 0000h
B1CON_B1FILHIT0_POSITION                 equ 0000h
B1CON_B1FILHIT0_SIZE                     equ 0001h
B1CON_B1FILHIT0_LENGTH                   equ 0001h
B1CON_B1FILHIT0_MASK                     equ 0001h
B1CON_B1FILHIT1_POSN                     equ 0001h
B1CON_B1FILHIT1_POSITION                 equ 0001h
B1CON_B1FILHIT1_SIZE                     equ 0001h
B1CON_B1FILHIT1_LENGTH                   equ 0001h
B1CON_B1FILHIT1_MASK                     equ 0002h
B1CON_B1FILHIT2_POSN                     equ 0002h
B1CON_B1FILHIT2_POSITION                 equ 0002h
B1CON_B1FILHIT2_SIZE                     equ 0001h
B1CON_B1FILHIT2_LENGTH                   equ 0001h
B1CON_B1FILHIT2_MASK                     equ 0004h
B1CON_B1FILHIT3_POSN                     equ 0003h
B1CON_B1FILHIT3_POSITION                 equ 0003h
B1CON_B1FILHIT3_SIZE                     equ 0001h
B1CON_B1FILHIT3_LENGTH                   equ 0001h
B1CON_B1FILHIT3_MASK                     equ 0008h
B1CON_B1FILHIT4_POSN                     equ 0004h
B1CON_B1FILHIT4_POSITION                 equ 0004h
B1CON_B1FILHIT4_SIZE                     equ 0001h
B1CON_B1FILHIT4_LENGTH                   equ 0001h
B1CON_B1FILHIT4_MASK                     equ 0010h
B1CON_B1RTRRO_POSN                       equ 0005h
B1CON_B1RTRRO_POSITION                   equ 0005h
B1CON_B1RTRRO_SIZE                       equ 0001h
B1CON_B1RTRRO_LENGTH                     equ 0001h
B1CON_B1RTRRO_MASK                       equ 0020h
B1CON_B1RXM1_POSN                        equ 0006h
B1CON_B1RXM1_POSITION                    equ 0006h
B1CON_B1RXM1_SIZE                        equ 0001h
B1CON_B1RXM1_LENGTH                      equ 0001h
B1CON_B1RXM1_MASK                        equ 0040h
B1CON_B1RXFUL_POSN                       equ 0007h
B1CON_B1RXFUL_POSITION                   equ 0007h
B1CON_B1RXFUL_SIZE                       equ 0001h
B1CON_B1RXFUL_LENGTH                     equ 0001h
B1CON_B1RXFUL_MASK                       equ 0080h
B1CON_B1TXPRI0_POSN                      equ 0000h
B1CON_B1TXPRI0_POSITION                  equ 0000h
B1CON_B1TXPRI0_SIZE                      equ 0001h
B1CON_B1TXPRI0_LENGTH                    equ 0001h
B1CON_B1TXPRI0_MASK                      equ 0001h
B1CON_B1TXPRI1_POSN                      equ 0001h
B1CON_B1TXPRI1_POSITION                  equ 0001h
B1CON_B1TXPRI1_SIZE                      equ 0001h
B1CON_B1TXPRI1_LENGTH                    equ 0001h
B1CON_B1TXPRI1_MASK                      equ 0002h
B1CON_B1RTREN_POSN                       equ 0002h
B1CON_B1RTREN_POSITION                   equ 0002h
B1CON_B1RTREN_SIZE                       equ 0001h
B1CON_B1RTREN_LENGTH                     equ 0001h
B1CON_B1RTREN_MASK                       equ 0004h
B1CON_B1TXREQ_POSN                       equ 0003h
B1CON_B1TXREQ_POSITION                   equ 0003h
B1CON_B1TXREQ_SIZE                       equ 0001h
B1CON_B1TXREQ_LENGTH                     equ 0001h
B1CON_B1TXREQ_MASK                       equ 0008h
B1CON_B1TXERR_POSN                       equ 0004h
B1CON_B1TXERR_POSITION                   equ 0004h
B1CON_B1TXERR_SIZE                       equ 0001h
B1CON_B1TXERR_LENGTH                     equ 0001h
B1CON_B1TXERR_MASK                       equ 0010h
B1CON_B1TXLARB_POSN                      equ 0005h
B1CON_B1TXLARB_POSITION                  equ 0005h
B1CON_B1TXLARB_SIZE                      equ 0001h
B1CON_B1TXLARB_LENGTH                    equ 0001h
B1CON_B1TXLARB_MASK                      equ 0020h
B1CON_B1TXABT_POSN                       equ 0006h
B1CON_B1TXABT_POSITION                   equ 0006h
B1CON_B1TXABT_SIZE                       equ 0001h
B1CON_B1TXABT_LENGTH                     equ 0001h
B1CON_B1TXABT_MASK                       equ 0040h
B1CON_B1TXB3IF_POSN                      equ 0007h
B1CON_B1TXB3IF_POSITION                  equ 0007h
B1CON_B1TXB3IF_SIZE                      equ 0001h
B1CON_B1TXB3IF_LENGTH                    equ 0001h
B1CON_B1TXB3IF_MASK                      equ 0080h

// Register: B1SIDH
#define B1SIDH B1SIDH
B1SIDH                                   equ 0E91h
// bitfield definitions
B1SIDH_SID_POSN                          equ 0000h
B1SIDH_SID_POSITION                      equ 0000h
B1SIDH_SID_SIZE                          equ 0008h
B1SIDH_SID_LENGTH                        equ 0008h
B1SIDH_SID_MASK                          equ 00FFh
B1SIDH_SID3_POSN                         equ 0000h
B1SIDH_SID3_POSITION                     equ 0000h
B1SIDH_SID3_SIZE                         equ 0001h
B1SIDH_SID3_LENGTH                       equ 0001h
B1SIDH_SID3_MASK                         equ 0001h
B1SIDH_SID4_POSN                         equ 0001h
B1SIDH_SID4_POSITION                     equ 0001h
B1SIDH_SID4_SIZE                         equ 0001h
B1SIDH_SID4_LENGTH                       equ 0001h
B1SIDH_SID4_MASK                         equ 0002h
B1SIDH_SID5_POSN                         equ 0002h
B1SIDH_SID5_POSITION                     equ 0002h
B1SIDH_SID5_SIZE                         equ 0001h
B1SIDH_SID5_LENGTH                       equ 0001h
B1SIDH_SID5_MASK                         equ 0004h
B1SIDH_SID6_POSN                         equ 0003h
B1SIDH_SID6_POSITION                     equ 0003h
B1SIDH_SID6_SIZE                         equ 0001h
B1SIDH_SID6_LENGTH                       equ 0001h
B1SIDH_SID6_MASK                         equ 0008h
B1SIDH_SID7_POSN                         equ 0004h
B1SIDH_SID7_POSITION                     equ 0004h
B1SIDH_SID7_SIZE                         equ 0001h
B1SIDH_SID7_LENGTH                       equ 0001h
B1SIDH_SID7_MASK                         equ 0010h
B1SIDH_SID8_POSN                         equ 0005h
B1SIDH_SID8_POSITION                     equ 0005h
B1SIDH_SID8_SIZE                         equ 0001h
B1SIDH_SID8_LENGTH                       equ 0001h
B1SIDH_SID8_MASK                         equ 0020h
B1SIDH_SID9_POSN                         equ 0006h
B1SIDH_SID9_POSITION                     equ 0006h
B1SIDH_SID9_SIZE                         equ 0001h
B1SIDH_SID9_LENGTH                       equ 0001h
B1SIDH_SID9_MASK                         equ 0040h
B1SIDH_SID10_POSN                        equ 0007h
B1SIDH_SID10_POSITION                    equ 0007h
B1SIDH_SID10_SIZE                        equ 0001h
B1SIDH_SID10_LENGTH                      equ 0001h
B1SIDH_SID10_MASK                        equ 0080h
B1SIDH_B1SID3_POSN                       equ 0000h
B1SIDH_B1SID3_POSITION                   equ 0000h
B1SIDH_B1SID3_SIZE                       equ 0001h
B1SIDH_B1SID3_LENGTH                     equ 0001h
B1SIDH_B1SID3_MASK                       equ 0001h
B1SIDH_B1SID4_POSN                       equ 0001h
B1SIDH_B1SID4_POSITION                   equ 0001h
B1SIDH_B1SID4_SIZE                       equ 0001h
B1SIDH_B1SID4_LENGTH                     equ 0001h
B1SIDH_B1SID4_MASK                       equ 0002h
B1SIDH_B1SID5_POSN                       equ 0002h
B1SIDH_B1SID5_POSITION                   equ 0002h
B1SIDH_B1SID5_SIZE                       equ 0001h
B1SIDH_B1SID5_LENGTH                     equ 0001h
B1SIDH_B1SID5_MASK                       equ 0004h
B1SIDH_B1SID6_POSN                       equ 0003h
B1SIDH_B1SID6_POSITION                   equ 0003h
B1SIDH_B1SID6_SIZE                       equ 0001h
B1SIDH_B1SID6_LENGTH                     equ 0001h
B1SIDH_B1SID6_MASK                       equ 0008h
B1SIDH_B1SID7_POSN                       equ 0004h
B1SIDH_B1SID7_POSITION                   equ 0004h
B1SIDH_B1SID7_SIZE                       equ 0001h
B1SIDH_B1SID7_LENGTH                     equ 0001h
B1SIDH_B1SID7_MASK                       equ 0010h
B1SIDH_B1SID8_POSN                       equ 0005h
B1SIDH_B1SID8_POSITION                   equ 0005h
B1SIDH_B1SID8_SIZE                       equ 0001h
B1SIDH_B1SID8_LENGTH                     equ 0001h
B1SIDH_B1SID8_MASK                       equ 0020h
B1SIDH_B1SID9_POSN                       equ 0006h
B1SIDH_B1SID9_POSITION                   equ 0006h
B1SIDH_B1SID9_SIZE                       equ 0001h
B1SIDH_B1SID9_LENGTH                     equ 0001h
B1SIDH_B1SID9_MASK                       equ 0040h
B1SIDH_B1SID10_POSN                      equ 0007h
B1SIDH_B1SID10_POSITION                  equ 0007h
B1SIDH_B1SID10_SIZE                      equ 0001h
B1SIDH_B1SID10_LENGTH                    equ 0001h
B1SIDH_B1SID10_MASK                      equ 0080h

