GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k80.inc
// Register: B1SIDL
#define B1SIDL B1SIDL
B1SIDL                                   equ 0E92h
// bitfield definitions
B1SIDL_EID_POSN                          equ 0000h
B1SIDL_EID_POSITION                      equ 0000h
B1SIDL_EID_SIZE                          equ 0002h
B1SIDL_EID_LENGTH                        equ 0002h
B1SIDL_EID_MASK                          equ 0003h
B1SIDL_EXIDE_POSN                        equ 0003h
B1SIDL_EXIDE_POSITION                    equ 0003h
B1SIDL_EXIDE_SIZE                        equ 0001h
B1SIDL_EXIDE_LENGTH                      equ 0001h
B1SIDL_EXIDE_MASK                        equ 0008h
B1SIDL_SRR_POSN                          equ 0004h
B1SIDL_SRR_POSITION                      equ 0004h
B1SIDL_SRR_SIZE                          equ 0001h
B1SIDL_SRR_LENGTH                        equ 0001h
B1SIDL_SRR_MASK                          equ 0010h
B1SIDL_SID_POSN                          equ 0005h
B1SIDL_SID_POSITION                      equ 0005h
B1SIDL_SID_SIZE                          equ 0003h
B1SIDL_SID_LENGTH                        equ 0003h
B1SIDL_SID_MASK                          equ 00E0h
B1SIDL_EID16_POSN                        equ 0000h
B1SIDL_EID16_POSITION                    equ 0000h
B1SIDL_EID16_SIZE                        equ 0001h
B1SIDL_EID16_LENGTH                      equ 0001h
B1SIDL_EID16_MASK                        equ 0001h
B1SIDL_EID17_POSN                        equ 0001h
B1SIDL_EID17_POSITION                    equ 0001h
B1SIDL_EID17_SIZE                        equ 0001h
B1SIDL_EID17_LENGTH                      equ 0001h
B1SIDL_EID17_MASK                        equ 0002h
B1SIDL_SID0_POSN                         equ 0005h
B1SIDL_SID0_POSITION                     equ 0005h
B1SIDL_SID0_SIZE                         equ 0001h
B1SIDL_SID0_LENGTH                       equ 0001h
B1SIDL_SID0_MASK                         equ 0020h
B1SIDL_SID1_POSN                         equ 0006h
B1SIDL_SID1_POSITION                     equ 0006h
B1SIDL_SID1_SIZE                         equ 0001h
B1SIDL_SID1_LENGTH                       equ 0001h
B1SIDL_SID1_MASK                         equ 0040h
B1SIDL_SID2_POSN                         equ 0007h
B1SIDL_SID2_POSITION                     equ 0007h
B1SIDL_SID2_SIZE                         equ 0001h
B1SIDL_SID2_LENGTH                       equ 0001h
B1SIDL_SID2_MASK                         equ 0080h
B1SIDL_B1EID16_POSN                      equ 0000h
B1SIDL_B1EID16_POSITION                  equ 0000h
B1SIDL_B1EID16_SIZE                      equ 0001h
B1SIDL_B1EID16_LENGTH                    equ 0001h
B1SIDL_B1EID16_MASK                      equ 0001h
B1SIDL_B1EID17_POSN                      equ 0001h
B1SIDL_B1EID17_POSITION                  equ 0001h
B1SIDL_B1EID17_SIZE                      equ 0001h
B1SIDL_B1EID17_LENGTH                    equ 0001h
B1SIDL_B1EID17_MASK                      equ 0002h
B1SIDL_B1EXID_POSN                       equ 0003h
B1SIDL_B1EXID_POSITION                   equ 0003h
B1SIDL_B1EXID_SIZE                       equ 0001h
B1SIDL_B1EXID_LENGTH                     equ 0001h
B1SIDL_B1EXID_MASK                       equ 0008h
B1SIDL_B1SRR_POSN                        equ 0004h
B1SIDL_B1SRR_POSITION                    equ 0004h
B1SIDL_B1SRR_SIZE                        equ 0001h
B1SIDL_B1SRR_LENGTH                      equ 0001h
B1SIDL_B1SRR_MASK                        equ 0010h
B1SIDL_B1SID0_POSN                       equ 0005h
B1SIDL_B1SID0_POSITION                   equ 0005h
B1SIDL_B1SID0_SIZE                       equ 0001h
B1SIDL_B1SID0_LENGTH                     equ 0001h
B1SIDL_B1SID0_MASK                       equ 0020h
B1SIDL_B1SID1_POSN                       equ 0006h
B1SIDL_B1SID1_POSITION                   equ 0006h
B1SIDL_B1SID1_SIZE                       equ 0001h
B1SIDL_B1SID1_LENGTH                     equ 0001h
B1SIDL_B1SID1_MASK                       equ 0040h
B1SIDL_B1SID2_POSN                       equ 0007h
B1SIDL_B1SID2_POSITION                   equ 0007h
B1SIDL_B1SID2_SIZE                       equ 0001h
B1SIDL_B1SID2_LENGTH                     equ 0001h
B1SIDL_B1SID2_MASK                       equ 0080h

// Register: B1EIDH
#define B1EIDH B1EIDH
B1EIDH                                   equ 0E93h
// bitfield definitions
B1EIDH_EID_POSN                          equ 0000h
B1EIDH_EID_POSITION                      equ 0000h
B1EIDH_EID_SIZE                          equ 0008h
B1EIDH_EID_LENGTH                        equ 0008h
B1EIDH_EID_MASK                          equ 00FFh
B1EIDH_EID8_POSN                         equ 0000h
B1EIDH_EID8_POSITION                     equ 0000h
B1EIDH_EID8_SIZE                         equ 0001h
B1EIDH_EID8_LENGTH                       equ 0001h
B1EIDH_EID8_MASK                         equ 0001h
B1EIDH_EID9_POSN                         equ 0001h
B1EIDH_EID9_POSITION                     equ 0001h
B1EIDH_EID9_SIZE                         equ 0001h
B1EIDH_EID9_LENGTH                       equ 0001h
B1EIDH_EID9_MASK                         equ 0002h
B1EIDH_EID10_POSN                        equ 0002h
B1EIDH_EID10_POSITION                    equ 0002h
B1EIDH_EID10_SIZE                        equ 0001h
B1EIDH_EID10_LENGTH                      equ 0001h
B1EIDH_EID10_MASK                        equ 0004h
B1EIDH_EID11_POSN                        equ 0003h
B1EIDH_EID11_POSITION                    equ 0003h
B1EIDH_EID11_SIZE                        equ 0001h
B1EIDH_EID11_LENGTH                      equ 0001h
B1EIDH_EID11_MASK                        equ 0008h
B1EIDH_EID12_POSN                        equ 0004h
B1EIDH_EID12_POSITION                    equ 0004h
B1EIDH_EID12_SIZE                        equ 0001h
B1EIDH_EID12_LENGTH                      equ 0001h
B1EIDH_EID12_MASK                        equ 0010h
B1EIDH_EID13_POSN                        equ 0005h
B1EIDH_EID13_POSITION                    equ 0005h
B1EIDH_EID13_SIZE                        equ 0001h
B1EIDH_EID13_LENGTH                      equ 0001h
B1EIDH_EID13_MASK                        equ 0020h
B1EIDH_EID14_POSN                        equ 0006h
B1EIDH_EID14_POSITION                    equ 0006h
B1EIDH_EID14_SIZE                        equ 0001h
B1EIDH_EID14_LENGTH                      equ 0001h
B1EIDH_EID14_MASK                        equ 0040h
B1EIDH_EID15_POSN                        equ 0007h
B1EIDH_EID15_POSITION                    equ 0007h
B1EIDH_EID15_SIZE                        equ 0001h
B1EIDH_EID15_LENGTH                      equ 0001h
B1EIDH_EID15_MASK                        equ 0080h
B1EIDH_B1EID8_POSN                       equ 0000h
B1EIDH_B1EID8_POSITION                   equ 0000h
B1EIDH_B1EID8_SIZE                       equ 0001h
B1EIDH_B1EID8_LENGTH                     equ 0001h
B1EIDH_B1EID8_MASK                       equ 0001h
B1EIDH_B1EID9_POSN                       equ 0001h
B1EIDH_B1EID9_POSITION                   equ 0001h
B1EIDH_B1EID9_SIZE                       equ 0001h
B1EIDH_B1EID9_LENGTH                     equ 0001h
B1EIDH_B1EID9_MASK                       equ 0002h
B1EIDH_B1EID10_POSN                      equ 0002h
B1EIDH_B1EID10_POSITION                  equ 0002h
B1EIDH_B1EID10_SIZE                      equ 0001h
B1EIDH_B1EID10_LENGTH                    equ 0001h
B1EIDH_B1EID10_MASK                      equ 0004h
B1EIDH_B1EID11_POSN                      equ 0003h
B1EIDH_B1EID11_POSITION                  equ 0003h
B1EIDH_B1EID11_SIZE                      equ 0001h
B1EIDH_B1EID11_LENGTH                    equ 0001h
B1EIDH_B1EID11_MASK                      equ 0008h
B1EIDH_B1EID12_POSN                      equ 0004h
B1EIDH_B1EID12_POSITION                  equ 0004h
B1EIDH_B1EID12_SIZE                      equ 0001h
B1EIDH_B1EID12_LENGTH                    equ 0001h
B1EIDH_B1EID12_MASK                      equ 0010h
B1EIDH_B1EID13_POSN                      equ 0005h
B1EIDH_B1EID13_POSITION                  equ 0005h
B1EIDH_B1EID13_SIZE                      equ 0001h
B1EIDH_B1EID13_LENGTH                    equ 0001h
B1EIDH_B1EID13_MASK                      equ 0020h
B1EIDH_B1EID14_POSN                      equ 0006h
B1EIDH_B1EID14_POSITION                  equ 0006h
B1EIDH_B1EID14_SIZE                      equ 0001h
B1EIDH_B1EID14_LENGTH                    equ 0001h
B1EIDH_B1EID14_MASK                      equ 0040h
B1EIDH_B1EID15_POSN                      equ 0007h
B1EIDH_B1EID15_POSITION                  equ 0007h
B1EIDH_B1EID15_SIZE                      equ 0001h
B1EIDH_B1EID15_LENGTH                    equ 0001h
B1EIDH_B1EID15_MASK                      equ 0080h

// Register: B1EIDL
#define B1EIDL B1EIDL
B1EIDL                                   equ 0E94h
// bitfield definitions
B1EIDL_EID_POSN                          equ 0000h
B1EIDL_EID_POSITION                      equ 0000h
B1EIDL_EID_SIZE                          equ 0008h
B1EIDL_EID_LENGTH                        equ 0008h
B1EIDL_EID_MASK                          equ 00FFh
B1EIDL_EID0_POSN                         equ 0000h
B1EIDL_EID0_POSITION                     equ 0000h
B1EIDL_EID0_SIZE                         equ 0001h
B1EIDL_EID0_LENGTH                       equ 0001h
B1EIDL_EID0_MASK                         equ 0001h
B1EIDL_EID1_POSN                         equ 0001h
B1EIDL_EID1_POSITION                     equ 0001h
B1EIDL_EID1_SIZE                         equ 0001h
B1EIDL_EID1_LENGTH                       equ 0001h
B1EIDL_EID1_MASK                         equ 0002h
B1EIDL_EID2_POSN                         equ 0002h
B1EIDL_EID2_POSITION                     equ 0002h
B1EIDL_EID2_SIZE                         equ 0001h
B1EIDL_EID2_LENGTH                       equ 0001h
B1EIDL_EID2_MASK                         equ 0004h
B1EIDL_EID3_POSN                         equ 0003h
B1EIDL_EID3_POSITION                     equ 0003h
B1EIDL_EID3_SIZE                         equ 0001h
B1EIDL_EID3_LENGTH                       equ 0001h
B1EIDL_EID3_MASK                         equ 0008h
B1EIDL_EID4_POSN                         equ 0004h
B1EIDL_EID4_POSITION                     equ 0004h
B1EIDL_EID4_SIZE                         equ 0001h
B1EIDL_EID4_LENGTH                       equ 0001h
B1EIDL_EID4_MASK                         equ 0010h
B1EIDL_EID5_POSN                         equ 0005h
B1EIDL_EID5_POSITION                     equ 0005h
B1EIDL_EID5_SIZE                         equ 0001h
B1EIDL_EID5_LENGTH                       equ 0001h
B1EIDL_EID5_MASK                         equ 0020h
B1EIDL_EID6_POSN                         equ 0006h
B1EIDL_EID6_POSITION                     equ 0006h
B1EIDL_EID6_SIZE                         equ 0001h
B1EIDL_EID6_LENGTH                       equ 0001h
B1EIDL_EID6_MASK                         equ 0040h
B1EIDL_EID7_POSN                         equ 0007h
B1EIDL_EID7_POSITION                     equ 0007h
B1EIDL_EID7_SIZE                         equ 0001h
B1EIDL_EID7_LENGTH                       equ 0001h
B1EIDL_EID7_MASK                         equ 0080h
B1EIDL_B1EID0_POSN                       equ 0000h
B1EIDL_B1EID0_POSITION                   equ 0000h
B1EIDL_B1EID0_SIZE                       equ 0001h
B1EIDL_B1EID0_LENGTH                     equ 0001h
B1EIDL_B1EID0_MASK                       equ 0001h
B1EIDL_B1EID1_POSN                       equ 0001h
B1EIDL_B1EID1_POSITION                   equ 0001h
B1EIDL_B1EID1_SIZE                       equ 0001h
B1EIDL_B1EID1_LENGTH                     equ 0001h
B1EIDL_B1EID1_MASK                       equ 0002h
B1EIDL_B1EID2_POSN                       equ 0002h
B1EIDL_B1EID2_POSITION                   equ 0002h
B1EIDL_B1EID2_SIZE                       equ 0001h
B1EIDL_B1EID2_LENGTH                     equ 0001h
B1EIDL_B1EID2_MASK                       equ 0004h
B1EIDL_B1EID3_POSN                       equ 0003h
B1EIDL_B1EID3_POSITION                   equ 0003h
B1EIDL_B1EID3_SIZE                       equ 0001h
B1EIDL_B1EID3_LENGTH                     equ 0001h
B1EIDL_B1EID3_MASK                       equ 0008h
B1EIDL_B1EID4_POSN                       equ 0004h
B1EIDL_B1EID4_POSITION                   equ 0004h
B1EIDL_B1EID4_SIZE                       equ 0001h
B1EIDL_B1EID4_LENGTH                     equ 0001h
B1EIDL_B1EID4_MASK                       equ 0010h
B1EIDL_B1EID5_POSN                       equ 0005h
B1EIDL_B1EID5_POSITION                   equ 0005h
B1EIDL_B1EID5_SIZE                       equ 0001h
B1EIDL_B1EID5_LENGTH                     equ 0001h
B1EIDL_B1EID5_MASK                       equ 0020h
B1EIDL_B1EID6_POSN                       equ 0006h
B1EIDL_B1EID6_POSITION                   equ 0006h
B1EIDL_B1EID6_SIZE                       equ 0001h
B1EIDL_B1EID6_LENGTH                     equ 0001h
B1EIDL_B1EID6_MASK                       equ 0040h
B1EIDL_B1EID7_POSN                       equ 0007h
B1EIDL_B1EID7_POSITION                   equ 0007h
B1EIDL_B1EID7_SIZE                       equ 0001h
B1EIDL_B1EID7_LENGTH                     equ 0001h
B1EIDL_B1EID7_MASK                       equ 0080h

// Register: B1DLC
#define B1DLC B1DLC
B1DLC                                    equ 0E95h
// bitfield definitions
B1DLC_DLC_POSN                           equ 0000h
B1DLC_DLC_POSITION                       equ 0000h
B1DLC_DLC_SIZE                           equ 0004h
B1DLC_DLC_LENGTH                         equ 0004h
B1DLC_DLC_MASK                           equ 000Fh
B1DLC_RB_POSN                            equ 0004h
B1DLC_RB_POSITION                        equ 0004h
B1DLC_RB_SIZE                            equ 0002h
B1DLC_RB_LENGTH                          equ 0002h
B1DLC_RB_MASK                            equ 0030h
B1DLC_RXRTR_TXRTR_POSN                   equ 0006h
B1DLC_RXRTR_TXRTR_POSITION               equ 0006h
B1DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B1DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B1DLC_RXRTR_TXRTR_MASK                   equ 0040h
B1DLC_DLC0_POSN                          equ 0000h
B1DLC_DLC0_POSITION                      equ 0000h
B1DLC_DLC0_SIZE                          equ 0001h
B1DLC_DLC0_LENGTH                        equ 0001h
B1DLC_DLC0_MASK                          equ 0001h
B1DLC_DLC1_POSN                          equ 0001h
B1DLC_DLC1_POSITION                      equ 0001h
B1DLC_DLC1_SIZE                          equ 0001h
B1DLC_DLC1_LENGTH                        equ 0001h
B1DLC_DLC1_MASK                          equ 0002h
B1DLC_DLC2_POSN                          equ 0002h
B1DLC_DLC2_POSITION                      equ 0002h
B1DLC_DLC2_SIZE                          equ 0001h
B1DLC_DLC2_LENGTH                        equ 0001h
B1DLC_DLC2_MASK                          equ 0004h
B1DLC_DLC3_POSN                          equ 0003h
B1DLC_DLC3_POSITION                      equ 0003h
B1DLC_DLC3_SIZE                          equ 0001h
B1DLC_DLC3_LENGTH                        equ 0001h
B1DLC_DLC3_MASK                          equ 0008h
B1DLC_RB0_POSN                           equ 0004h
B1DLC_RB0_POSITION                       equ 0004h
B1DLC_RB0_SIZE                           equ 0001h
B1DLC_RB0_LENGTH                         equ 0001h
B1DLC_RB0_MASK                           equ 0010h
B1DLC_RB1_POSN                           equ 0005h
B1DLC_RB1_POSITION                       equ 0005h
B1DLC_RB1_SIZE                           equ 0001h
B1DLC_RB1_LENGTH                         equ 0001h
B1DLC_RB1_MASK                           equ 0020h
B1DLC_RXRTR_POSN                         equ 0006h
B1DLC_RXRTR_POSITION                     equ 0006h
B1DLC_RXRTR_SIZE                         equ 0001h
B1DLC_RXRTR_LENGTH                       equ 0001h
B1DLC_RXRTR_MASK                         equ 0040h
B1DLC_TXRTR_POSN                         equ 0006h
B1DLC_TXRTR_POSITION                     equ 0006h
B1DLC_TXRTR_SIZE                         equ 0001h
B1DLC_TXRTR_LENGTH                       equ 0001h
B1DLC_TXRTR_MASK                         equ 0040h
B1DLC_B1DLC0_POSN                        equ 0000h
B1DLC_B1DLC0_POSITION                    equ 0000h
B1DLC_B1DLC0_SIZE                        equ 0001h
B1DLC_B1DLC0_LENGTH                      equ 0001h
B1DLC_B1DLC0_MASK                        equ 0001h
B1DLC_B1DLC1_POSN                        equ 0001h
B1DLC_B1DLC1_POSITION                    equ 0001h
B1DLC_B1DLC1_SIZE                        equ 0001h
B1DLC_B1DLC1_LENGTH                      equ 0001h
B1DLC_B1DLC1_MASK                        equ 0002h
B1DLC_B1DLC2_POSN                        equ 0002h
B1DLC_B1DLC2_POSITION                    equ 0002h
B1DLC_B1DLC2_SIZE                        equ 0001h
B1DLC_B1DLC2_LENGTH                      equ 0001h
B1DLC_B1DLC2_MASK                        equ 0004h
B1DLC_B1DLC3_POSN                        equ 0003h
B1DLC_B1DLC3_POSITION                    equ 0003h
B1DLC_B1DLC3_SIZE                        equ 0001h
B1DLC_B1DLC3_LENGTH                      equ 0001h
B1DLC_B1DLC3_MASK                        equ 0008h
B1DLC_B1RB0_POSN                         equ 0004h
B1DLC_B1RB0_POSITION                     equ 0004h
B1DLC_B1RB0_SIZE                         equ 0001h
B1DLC_B1RB0_LENGTH                       equ 0001h
B1DLC_B1RB0_MASK                         equ 0010h
B1DLC_B1RB1_POSN                         equ 0005h
B1DLC_B1RB1_POSITION                     equ 0005h
B1DLC_B1RB1_SIZE                         equ 0001h
B1DLC_B1RB1_LENGTH                       equ 0001h
B1DLC_B1RB1_MASK                         equ 0020h
B1DLC_B1RXRTR_POSN                       equ 0006h
B1DLC_B1RXRTR_POSITION                   equ 0006h
B1DLC_B1RXRTR_SIZE                       equ 0001h
B1DLC_B1RXRTR_LENGTH                     equ 0001h
B1DLC_B1RXRTR_MASK                       equ 0040h

