GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k80.inc
// Register: RXF5SIDH
#define RXF5SIDH RXF5SIDH
RXF5SIDH                                 equ 0EF4h
// bitfield definitions
RXF5SIDH_SID_POSN                        equ 0000h
RXF5SIDH_SID_POSITION                    equ 0000h
RXF5SIDH_SID_SIZE                        equ 0008h
RXF5SIDH_SID_LENGTH                      equ 0008h
RXF5SIDH_SID_MASK                        equ 00FFh
RXF5SIDH_SID3_POSN                       equ 0000h
RXF5SIDH_SID3_POSITION                   equ 0000h
RXF5SIDH_SID3_SIZE                       equ 0001h
RXF5SIDH_SID3_LENGTH                     equ 0001h
RXF5SIDH_SID3_MASK                       equ 0001h
RXF5SIDH_SID4_POSN                       equ 0001h
RXF5SIDH_SID4_POSITION                   equ 0001h
RXF5SIDH_SID4_SIZE                       equ 0001h
RXF5SIDH_SID4_LENGTH                     equ 0001h
RXF5SIDH_SID4_MASK                       equ 0002h
RXF5SIDH_SID5_POSN                       equ 0002h
RXF5SIDH_SID5_POSITION                   equ 0002h
RXF5SIDH_SID5_SIZE                       equ 0001h
RXF5SIDH_SID5_LENGTH                     equ 0001h
RXF5SIDH_SID5_MASK                       equ 0004h
RXF5SIDH_SID6_POSN                       equ 0003h
RXF5SIDH_SID6_POSITION                   equ 0003h
RXF5SIDH_SID6_SIZE                       equ 0001h
RXF5SIDH_SID6_LENGTH                     equ 0001h
RXF5SIDH_SID6_MASK                       equ 0008h
RXF5SIDH_SID7_POSN                       equ 0004h
RXF5SIDH_SID7_POSITION                   equ 0004h
RXF5SIDH_SID7_SIZE                       equ 0001h
RXF5SIDH_SID7_LENGTH                     equ 0001h
RXF5SIDH_SID7_MASK                       equ 0010h
RXF5SIDH_SID8_POSN                       equ 0005h
RXF5SIDH_SID8_POSITION                   equ 0005h
RXF5SIDH_SID8_SIZE                       equ 0001h
RXF5SIDH_SID8_LENGTH                     equ 0001h
RXF5SIDH_SID8_MASK                       equ 0020h
RXF5SIDH_SID9_POSN                       equ 0006h
RXF5SIDH_SID9_POSITION                   equ 0006h
RXF5SIDH_SID9_SIZE                       equ 0001h
RXF5SIDH_SID9_LENGTH                     equ 0001h
RXF5SIDH_SID9_MASK                       equ 0040h
RXF5SIDH_SID10_POSN                      equ 0007h
RXF5SIDH_SID10_POSITION                  equ 0007h
RXF5SIDH_SID10_SIZE                      equ 0001h
RXF5SIDH_SID10_LENGTH                    equ 0001h
RXF5SIDH_SID10_MASK                      equ 0080h
RXF5SIDH_RXF5SID3_POSN                   equ 0000h
RXF5SIDH_RXF5SID3_POSITION               equ 0000h
RXF5SIDH_RXF5SID3_SIZE                   equ 0001h
RXF5SIDH_RXF5SID3_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID3_MASK                   equ 0001h
RXF5SIDH_RXF5SID4_POSN                   equ 0001h
RXF5SIDH_RXF5SID4_POSITION               equ 0001h
RXF5SIDH_RXF5SID4_SIZE                   equ 0001h
RXF5SIDH_RXF5SID4_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID4_MASK                   equ 0002h
RXF5SIDH_RXF5SID5_POSN                   equ 0002h
RXF5SIDH_RXF5SID5_POSITION               equ 0002h
RXF5SIDH_RXF5SID5_SIZE                   equ 0001h
RXF5SIDH_RXF5SID5_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID5_MASK                   equ 0004h
RXF5SIDH_RXF5SID6_POSN                   equ 0003h
RXF5SIDH_RXF5SID6_POSITION               equ 0003h
RXF5SIDH_RXF5SID6_SIZE                   equ 0001h
RXF5SIDH_RXF5SID6_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID6_MASK                   equ 0008h
RXF5SIDH_RXF5SID7_POSN                   equ 0004h
RXF5SIDH_RXF5SID7_POSITION               equ 0004h
RXF5SIDH_RXF5SID7_SIZE                   equ 0001h
RXF5SIDH_RXF5SID7_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID7_MASK                   equ 0010h
RXF5SIDH_RXF5SID8_POSN                   equ 0005h
RXF5SIDH_RXF5SID8_POSITION               equ 0005h
RXF5SIDH_RXF5SID8_SIZE                   equ 0001h
RXF5SIDH_RXF5SID8_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID8_MASK                   equ 0020h
RXF5SIDH_RXF5SID9_POSN                   equ 0006h
RXF5SIDH_RXF5SID9_POSITION               equ 0006h
RXF5SIDH_RXF5SID9_SIZE                   equ 0001h
RXF5SIDH_RXF5SID9_LENGTH                 equ 0001h
RXF5SIDH_RXF5SID9_MASK                   equ 0040h
RXF5SIDH_RXF5SID10_POSN                  equ 0007h
RXF5SIDH_RXF5SID10_POSITION              equ 0007h
RXF5SIDH_RXF5SID10_SIZE                  equ 0001h
RXF5SIDH_RXF5SID10_LENGTH                equ 0001h
RXF5SIDH_RXF5SID10_MASK                  equ 0080h

// Register: RXF5SIDL
#define RXF5SIDL RXF5SIDL
RXF5SIDL                                 equ 0EF5h
// bitfield definitions
RXF5SIDL_EID_POSN                        equ 0000h
RXF5SIDL_EID_POSITION                    equ 0000h
RXF5SIDL_EID_SIZE                        equ 0002h
RXF5SIDL_EID_LENGTH                      equ 0002h
RXF5SIDL_EID_MASK                        equ 0003h
RXF5SIDL_EXIDEN_POSN                     equ 0003h
RXF5SIDL_EXIDEN_POSITION                 equ 0003h
RXF5SIDL_EXIDEN_SIZE                     equ 0001h
RXF5SIDL_EXIDEN_LENGTH                   equ 0001h
RXF5SIDL_EXIDEN_MASK                     equ 0008h
RXF5SIDL_SID_POSN                        equ 0005h
RXF5SIDL_SID_POSITION                    equ 0005h
RXF5SIDL_SID_SIZE                        equ 0003h
RXF5SIDL_SID_LENGTH                      equ 0003h
RXF5SIDL_SID_MASK                        equ 00E0h
RXF5SIDL_EID16_POSN                      equ 0000h
RXF5SIDL_EID16_POSITION                  equ 0000h
RXF5SIDL_EID16_SIZE                      equ 0001h
RXF5SIDL_EID16_LENGTH                    equ 0001h
RXF5SIDL_EID16_MASK                      equ 0001h
RXF5SIDL_EID17_POSN                      equ 0001h
RXF5SIDL_EID17_POSITION                  equ 0001h
RXF5SIDL_EID17_SIZE                      equ 0001h
RXF5SIDL_EID17_LENGTH                    equ 0001h
RXF5SIDL_EID17_MASK                      equ 0002h
RXF5SIDL_SID0_POSN                       equ 0005h
RXF5SIDL_SID0_POSITION                   equ 0005h
RXF5SIDL_SID0_SIZE                       equ 0001h
RXF5SIDL_SID0_LENGTH                     equ 0001h
RXF5SIDL_SID0_MASK                       equ 0020h
RXF5SIDL_SID1_POSN                       equ 0006h
RXF5SIDL_SID1_POSITION                   equ 0006h
RXF5SIDL_SID1_SIZE                       equ 0001h
RXF5SIDL_SID1_LENGTH                     equ 0001h
RXF5SIDL_SID1_MASK                       equ 0040h
RXF5SIDL_SID2_POSN                       equ 0007h
RXF5SIDL_SID2_POSITION                   equ 0007h
RXF5SIDL_SID2_SIZE                       equ 0001h
RXF5SIDL_SID2_LENGTH                     equ 0001h
RXF5SIDL_SID2_MASK                       equ 0080h
RXF5SIDL_RXF5EID16_POSN                  equ 0000h
RXF5SIDL_RXF5EID16_POSITION              equ 0000h
RXF5SIDL_RXF5EID16_SIZE                  equ 0001h
RXF5SIDL_RXF5EID16_LENGTH                equ 0001h
RXF5SIDL_RXF5EID16_MASK                  equ 0001h
RXF5SIDL_RXF5EID17_POSN                  equ 0001h
RXF5SIDL_RXF5EID17_POSITION              equ 0001h
RXF5SIDL_RXF5EID17_SIZE                  equ 0001h
RXF5SIDL_RXF5EID17_LENGTH                equ 0001h
RXF5SIDL_RXF5EID17_MASK                  equ 0002h
RXF5SIDL_RXF5EXIDEN_POSN                 equ 0003h
RXF5SIDL_RXF5EXIDEN_POSITION             equ 0003h
RXF5SIDL_RXF5EXIDEN_SIZE                 equ 0001h
RXF5SIDL_RXF5EXIDEN_LENGTH               equ 0001h
RXF5SIDL_RXF5EXIDEN_MASK                 equ 0008h
RXF5SIDL_RXF5SID0_POSN                   equ 0005h
RXF5SIDL_RXF5SID0_POSITION               equ 0005h
RXF5SIDL_RXF5SID0_SIZE                   equ 0001h
RXF5SIDL_RXF5SID0_LENGTH                 equ 0001h
RXF5SIDL_RXF5SID0_MASK                   equ 0020h
RXF5SIDL_RXF5SID1_POSN                   equ 0006h
RXF5SIDL_RXF5SID1_POSITION               equ 0006h
RXF5SIDL_RXF5SID1_SIZE                   equ 0001h
RXF5SIDL_RXF5SID1_LENGTH                 equ 0001h
RXF5SIDL_RXF5SID1_MASK                   equ 0040h
RXF5SIDL_RXF5SID2_POSN                   equ 0007h
RXF5SIDL_RXF5SID2_POSITION               equ 0007h
RXF5SIDL_RXF5SID2_SIZE                   equ 0001h
RXF5SIDL_RXF5SID2_LENGTH                 equ 0001h
RXF5SIDL_RXF5SID2_MASK                   equ 0080h

// Register: RXF5EIDH
#define RXF5EIDH RXF5EIDH
RXF5EIDH                                 equ 0EF6h
// bitfield definitions
RXF5EIDH_EID_POSN                        equ 0000h
RXF5EIDH_EID_POSITION                    equ 0000h
RXF5EIDH_EID_SIZE                        equ 0008h
RXF5EIDH_EID_LENGTH                      equ 0008h
RXF5EIDH_EID_MASK                        equ 00FFh
RXF5EIDH_EID8_POSN                       equ 0000h
RXF5EIDH_EID8_POSITION                   equ 0000h
RXF5EIDH_EID8_SIZE                       equ 0001h
RXF5EIDH_EID8_LENGTH                     equ 0001h
RXF5EIDH_EID8_MASK                       equ 0001h
RXF5EIDH_EID9_POSN                       equ 0001h
RXF5EIDH_EID9_POSITION                   equ 0001h
RXF5EIDH_EID9_SIZE                       equ 0001h
RXF5EIDH_EID9_LENGTH                     equ 0001h
RXF5EIDH_EID9_MASK                       equ 0002h
RXF5EIDH_EID10_POSN                      equ 0002h
RXF5EIDH_EID10_POSITION                  equ 0002h
RXF5EIDH_EID10_SIZE                      equ 0001h
RXF5EIDH_EID10_LENGTH                    equ 0001h
RXF5EIDH_EID10_MASK                      equ 0004h
RXF5EIDH_EID11_POSN                      equ 0003h
RXF5EIDH_EID11_POSITION                  equ 0003h
RXF5EIDH_EID11_SIZE                      equ 0001h
RXF5EIDH_EID11_LENGTH                    equ 0001h
RXF5EIDH_EID11_MASK                      equ 0008h
RXF5EIDH_EID12_POSN                      equ 0004h
RXF5EIDH_EID12_POSITION                  equ 0004h
RXF5EIDH_EID12_SIZE                      equ 0001h
RXF5EIDH_EID12_LENGTH                    equ 0001h
RXF5EIDH_EID12_MASK                      equ 0010h
RXF5EIDH_EID13_POSN                      equ 0005h
RXF5EIDH_EID13_POSITION                  equ 0005h
RXF5EIDH_EID13_SIZE                      equ 0001h
RXF5EIDH_EID13_LENGTH                    equ 0001h
RXF5EIDH_EID13_MASK                      equ 0020h
RXF5EIDH_EID14_POSN                      equ 0006h
RXF5EIDH_EID14_POSITION                  equ 0006h
RXF5EIDH_EID14_SIZE                      equ 0001h
RXF5EIDH_EID14_LENGTH                    equ 0001h
RXF5EIDH_EID14_MASK                      equ 0040h
RXF5EIDH_EID15_POSN                      equ 0007h
RXF5EIDH_EID15_POSITION                  equ 0007h
RXF5EIDH_EID15_SIZE                      equ 0001h
RXF5EIDH_EID15_LENGTH                    equ 0001h
RXF5EIDH_EID15_MASK                      equ 0080h
RXF5EIDH_RXF5EID8_POSN                   equ 0000h
RXF5EIDH_RXF5EID8_POSITION               equ 0000h
RXF5EIDH_RXF5EID8_SIZE                   equ 0001h
RXF5EIDH_RXF5EID8_LENGTH                 equ 0001h
RXF5EIDH_RXF5EID8_MASK                   equ 0001h
RXF5EIDH_RXF5EID9_POSN                   equ 0001h
RXF5EIDH_RXF5EID9_POSITION               equ 0001h
RXF5EIDH_RXF5EID9_SIZE                   equ 0001h
RXF5EIDH_RXF5EID9_LENGTH                 equ 0001h
RXF5EIDH_RXF5EID9_MASK                   equ 0002h
RXF5EIDH_RXF5EID10_POSN                  equ 0002h
RXF5EIDH_RXF5EID10_POSITION              equ 0002h
RXF5EIDH_RXF5EID10_SIZE                  equ 0001h
RXF5EIDH_RXF5EID10_LENGTH                equ 0001h
RXF5EIDH_RXF5EID10_MASK                  equ 0004h
RXF5EIDH_RXF5EID11_POSN                  equ 0003h
RXF5EIDH_RXF5EID11_POSITION              equ 0003h
RXF5EIDH_RXF5EID11_SIZE                  equ 0001h
RXF5EIDH_RXF5EID11_LENGTH                equ 0001h
RXF5EIDH_RXF5EID11_MASK                  equ 0008h
RXF5EIDH_RXF5EID12_POSN                  equ 0004h
RXF5EIDH_RXF5EID12_POSITION              equ 0004h
RXF5EIDH_RXF5EID12_SIZE                  equ 0001h
RXF5EIDH_RXF5EID12_LENGTH                equ 0001h
RXF5EIDH_RXF5EID12_MASK                  equ 0010h
RXF5EIDH_RXF5EID13_POSN                  equ 0005h
RXF5EIDH_RXF5EID13_POSITION              equ 0005h
RXF5EIDH_RXF5EID13_SIZE                  equ 0001h
RXF5EIDH_RXF5EID13_LENGTH                equ 0001h
RXF5EIDH_RXF5EID13_MASK                  equ 0020h
RXF5EIDH_RXF5EID14_POSN                  equ 0006h
RXF5EIDH_RXF5EID14_POSITION              equ 0006h
RXF5EIDH_RXF5EID14_SIZE                  equ 0001h
RXF5EIDH_RXF5EID14_LENGTH                equ 0001h
RXF5EIDH_RXF5EID14_MASK                  equ 0040h
RXF5EIDH_RXF5EID15_POSN                  equ 0007h
RXF5EIDH_RXF5EID15_POSITION              equ 0007h
RXF5EIDH_RXF5EID15_SIZE                  equ 0001h
RXF5EIDH_RXF5EID15_LENGTH                equ 0001h
RXF5EIDH_RXF5EID15_MASK                  equ 0080h

// Register: RXF5EIDL
#define RXF5EIDL RXF5EIDL
RXF5EIDL                                 equ 0EF7h
// bitfield definitions
RXF5EIDL_EID_POSN                        equ 0000h
RXF5EIDL_EID_POSITION                    equ 0000h
RXF5EIDL_EID_SIZE                        equ 0008h
RXF5EIDL_EID_LENGTH                      equ 0008h
RXF5EIDL_EID_MASK                        equ 00FFh
RXF5EIDL_EID0_POSN                       equ 0000h
RXF5EIDL_EID0_POSITION                   equ 0000h
RXF5EIDL_EID0_SIZE                       equ 0001h
RXF5EIDL_EID0_LENGTH                     equ 0001h
RXF5EIDL_EID0_MASK                       equ 0001h
RXF5EIDL_EID1_POSN                       equ 0001h
RXF5EIDL_EID1_POSITION                   equ 0001h
RXF5EIDL_EID1_SIZE                       equ 0001h
RXF5EIDL_EID1_LENGTH                     equ 0001h
RXF5EIDL_EID1_MASK                       equ 0002h
RXF5EIDL_EID2_POSN                       equ 0002h
RXF5EIDL_EID2_POSITION                   equ 0002h
RXF5EIDL_EID2_SIZE                       equ 0001h
RXF5EIDL_EID2_LENGTH                     equ 0001h
RXF5EIDL_EID2_MASK                       equ 0004h
RXF5EIDL_EID3_POSN                       equ 0003h
RXF5EIDL_EID3_POSITION                   equ 0003h
RXF5EIDL_EID3_SIZE                       equ 0001h
RXF5EIDL_EID3_LENGTH                     equ 0001h
RXF5EIDL_EID3_MASK                       equ 0008h
RXF5EIDL_EID4_POSN                       equ 0004h
RXF5EIDL_EID4_POSITION                   equ 0004h
RXF5EIDL_EID4_SIZE                       equ 0001h
RXF5EIDL_EID4_LENGTH                     equ 0001h
RXF5EIDL_EID4_MASK                       equ 0010h
RXF5EIDL_EID5_POSN                       equ 0005h
RXF5EIDL_EID5_POSITION                   equ 0005h
RXF5EIDL_EID5_SIZE                       equ 0001h
RXF5EIDL_EID5_LENGTH                     equ 0001h
RXF5EIDL_EID5_MASK                       equ 0020h
RXF5EIDL_EID6_POSN                       equ 0006h
RXF5EIDL_EID6_POSITION                   equ 0006h
RXF5EIDL_EID6_SIZE                       equ 0001h
RXF5EIDL_EID6_LENGTH                     equ 0001h
RXF5EIDL_EID6_MASK                       equ 0040h
RXF5EIDL_EID7_POSN                       equ 0007h
RXF5EIDL_EID7_POSITION                   equ 0007h
RXF5EIDL_EID7_SIZE                       equ 0001h
RXF5EIDL_EID7_LENGTH                     equ 0001h
RXF5EIDL_EID7_MASK                       equ 0080h
RXF5EIDL_RXF5EID0_POSN                   equ 0000h
RXF5EIDL_RXF5EID0_POSITION               equ 0000h
RXF5EIDL_RXF5EID0_SIZE                   equ 0001h
RXF5EIDL_RXF5EID0_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID0_MASK                   equ 0001h
RXF5EIDL_RXF5EID1_POSN                   equ 0001h
RXF5EIDL_RXF5EID1_POSITION               equ 0001h
RXF5EIDL_RXF5EID1_SIZE                   equ 0001h
RXF5EIDL_RXF5EID1_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID1_MASK                   equ 0002h
RXF5EIDL_RXF5EID2_POSN                   equ 0002h
RXF5EIDL_RXF5EID2_POSITION               equ 0002h
RXF5EIDL_RXF5EID2_SIZE                   equ 0001h
RXF5EIDL_RXF5EID2_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID2_MASK                   equ 0004h
RXF5EIDL_RXF5EID3_POSN                   equ 0003h
RXF5EIDL_RXF5EID3_POSITION               equ 0003h
RXF5EIDL_RXF5EID3_SIZE                   equ 0001h
RXF5EIDL_RXF5EID3_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID3_MASK                   equ 0008h
RXF5EIDL_RXF5EID4_POSN                   equ 0004h
RXF5EIDL_RXF5EID4_POSITION               equ 0004h
RXF5EIDL_RXF5EID4_SIZE                   equ 0001h
RXF5EIDL_RXF5EID4_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID4_MASK                   equ 0010h
RXF5EIDL_RXF5EID5_POSN                   equ 0005h
RXF5EIDL_RXF5EID5_POSITION               equ 0005h
RXF5EIDL_RXF5EID5_SIZE                   equ 0001h
RXF5EIDL_RXF5EID5_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID5_MASK                   equ 0020h
RXF5EIDL_RXF5EID6_POSN                   equ 0006h
RXF5EIDL_RXF5EID6_POSITION               equ 0006h
RXF5EIDL_RXF5EID6_SIZE                   equ 0001h
RXF5EIDL_RXF5EID6_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID6_MASK                   equ 0040h
RXF5EIDL_RXF5EID7_POSN                   equ 0007h
RXF5EIDL_RXF5EID7_POSITION               equ 0007h
RXF5EIDL_RXF5EID7_SIZE                   equ 0001h
RXF5EIDL_RXF5EID7_LENGTH                 equ 0001h
RXF5EIDL_RXF5EID7_MASK                   equ 0080h

// Register: RXM0SIDH
#define RXM0SIDH RXM0SIDH
RXM0SIDH                                 equ 0EF8h
// bitfield definitions
RXM0SIDH_SID_POSN                        equ 0000h
RXM0SIDH_SID_POSITION                    equ 0000h
RXM0SIDH_SID_SIZE                        equ 0008h
RXM0SIDH_SID_LENGTH                      equ 0008h
RXM0SIDH_SID_MASK                        equ 00FFh
RXM0SIDH_SID3_POSN                       equ 0000h
RXM0SIDH_SID3_POSITION                   equ 0000h
RXM0SIDH_SID3_SIZE                       equ 0001h
RXM0SIDH_SID3_LENGTH                     equ 0001h
RXM0SIDH_SID3_MASK                       equ 0001h
RXM0SIDH_SID4_POSN                       equ 0001h
RXM0SIDH_SID4_POSITION                   equ 0001h
RXM0SIDH_SID4_SIZE                       equ 0001h
RXM0SIDH_SID4_LENGTH                     equ 0001h
RXM0SIDH_SID4_MASK                       equ 0002h
RXM0SIDH_SID5_POSN                       equ 0002h
RXM0SIDH_SID5_POSITION                   equ 0002h
RXM0SIDH_SID5_SIZE                       equ 0001h
RXM0SIDH_SID5_LENGTH                     equ 0001h
RXM0SIDH_SID5_MASK                       equ 0004h
RXM0SIDH_SID6_POSN                       equ 0003h
RXM0SIDH_SID6_POSITION                   equ 0003h
RXM0SIDH_SID6_SIZE                       equ 0001h
RXM0SIDH_SID6_LENGTH                     equ 0001h
RXM0SIDH_SID6_MASK                       equ 0008h
RXM0SIDH_SID7_POSN                       equ 0004h
RXM0SIDH_SID7_POSITION                   equ 0004h
RXM0SIDH_SID7_SIZE                       equ 0001h
RXM0SIDH_SID7_LENGTH                     equ 0001h
RXM0SIDH_SID7_MASK                       equ 0010h
RXM0SIDH_SID8_POSN                       equ 0005h
RXM0SIDH_SID8_POSITION                   equ 0005h
RXM0SIDH_SID8_SIZE                       equ 0001h
RXM0SIDH_SID8_LENGTH                     equ 0001h
RXM0SIDH_SID8_MASK                       equ 0020h
RXM0SIDH_SID9_POSN                       equ 0006h
RXM0SIDH_SID9_POSITION                   equ 0006h
RXM0SIDH_SID9_SIZE                       equ 0001h
RXM0SIDH_SID9_LENGTH                     equ 0001h
RXM0SIDH_SID9_MASK                       equ 0040h
RXM0SIDH_SID10_POSN                      equ 0007h
RXM0SIDH_SID10_POSITION                  equ 0007h
RXM0SIDH_SID10_SIZE                      equ 0001h
RXM0SIDH_SID10_LENGTH                    equ 0001h
RXM0SIDH_SID10_MASK                      equ 0080h
RXM0SIDH_RXM0SID3_POSN                   equ 0000h
RXM0SIDH_RXM0SID3_POSITION               equ 0000h
RXM0SIDH_RXM0SID3_SIZE                   equ 0001h
RXM0SIDH_RXM0SID3_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID3_MASK                   equ 0001h
RXM0SIDH_RXM0SID4_POSN                   equ 0001h
RXM0SIDH_RXM0SID4_POSITION               equ 0001h
RXM0SIDH_RXM0SID4_SIZE                   equ 0001h
RXM0SIDH_RXM0SID4_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID4_MASK                   equ 0002h
RXM0SIDH_RXM0SID5_POSN                   equ 0002h
RXM0SIDH_RXM0SID5_POSITION               equ 0002h
RXM0SIDH_RXM0SID5_SIZE                   equ 0001h
RXM0SIDH_RXM0SID5_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID5_MASK                   equ 0004h
RXM0SIDH_RXM0SID6_POSN                   equ 0003h
RXM0SIDH_RXM0SID6_POSITION               equ 0003h
RXM0SIDH_RXM0SID6_SIZE                   equ 0001h
RXM0SIDH_RXM0SID6_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID6_MASK                   equ 0008h
RXM0SIDH_RXM0SID7_POSN                   equ 0004h
RXM0SIDH_RXM0SID7_POSITION               equ 0004h
RXM0SIDH_RXM0SID7_SIZE                   equ 0001h
RXM0SIDH_RXM0SID7_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID7_MASK                   equ 0010h
RXM0SIDH_RXM0SID8_POSN                   equ 0005h
RXM0SIDH_RXM0SID8_POSITION               equ 0005h
RXM0SIDH_RXM0SID8_SIZE                   equ 0001h
RXM0SIDH_RXM0SID8_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID8_MASK                   equ 0020h
RXM0SIDH_RXM0SID9_POSN                   equ 0006h
RXM0SIDH_RXM0SID9_POSITION               equ 0006h
RXM0SIDH_RXM0SID9_SIZE                   equ 0001h
RXM0SIDH_RXM0SID9_LENGTH                 equ 0001h
RXM0SIDH_RXM0SID9_MASK                   equ 0040h
RXM0SIDH_RXM0SID10_POSN                  equ 0007h
RXM0SIDH_RXM0SID10_POSITION              equ 0007h
RXM0SIDH_RXM0SID10_SIZE                  equ 0001h
RXM0SIDH_RXM0SID10_LENGTH                equ 0001h
RXM0SIDH_RXM0SID10_MASK                  equ 0080h

