GopalSaraf/Practicals/PSDL/include/proc/pic18lf65k80.inc
#define RXF7EID13                        BANKMASK(RXF7EIDH), 5, b
#define RXF7EID14                        BANKMASK(RXF7EIDH), 6, b
#define RXF7EID15                        BANKMASK(RXF7EIDH), 7, b
#define RXF7EID16                        BANKMASK(RXF7SIDL), 0, b
#define RXF7EID17                        BANKMASK(RXF7SIDL), 1, b
#define RXF7EID2                         BANKMASK(RXF7EIDL), 2, b
#define RXF7EID3                         BANKMASK(RXF7EIDL), 3, b
#define RXF7EID4                         BANKMASK(RXF7EIDL), 4, b
#define RXF7EID5                         BANKMASK(RXF7EIDL), 5, b
#define RXF7EID6                         BANKMASK(RXF7EIDL), 6, b
#define RXF7EID7                         BANKMASK(RXF7EIDL), 7, b
#define RXF7EID8                         BANKMASK(RXF7EIDH), 0, b
#define RXF7EID9                         BANKMASK(RXF7EIDH), 1, b
#define RXF7EN                           BANKMASK(RXFCON0), 7, b
#define RXF7EXIDEN                       BANKMASK(RXF7SIDL), 3, b
#define RXF7SID0                         BANKMASK(RXF7SIDL), 5, b
#define RXF7SID1                         BANKMASK(RXF7SIDL), 6, b
#define RXF7SID10                        BANKMASK(RXF7SIDH), 7, b
#define RXF7SID2                         BANKMASK(RXF7SIDL), 7, b
#define RXF7SID3                         BANKMASK(RXF7SIDH), 0, b
#define RXF7SID4                         BANKMASK(RXF7SIDH), 1, b
#define RXF7SID5                         BANKMASK(RXF7SIDH), 2, b
#define RXF7SID6                         BANKMASK(RXF7SIDH), 3, b
#define RXF7SID7                         BANKMASK(RXF7SIDH), 4, b
#define RXF7SID8                         BANKMASK(RXF7SIDH), 5, b
#define RXF7SID9                         BANKMASK(RXF7SIDH), 6, b
#define RXF8EID0                         BANKMASK(RXF8EIDL), 0, b
#define RXF8EID1                         BANKMASK(RXF8EIDL), 1, b
#define RXF8EID10                        BANKMASK(RXF8EIDH), 2, b
#define RXF8EID11                        BANKMASK(RXF8EIDH), 3, b
#define RXF8EID12                        BANKMASK(RXF8EIDH), 4, b
#define RXF8EID13                        BANKMASK(RXF8EIDH), 5, b
#define RXF8EID14                        BANKMASK(RXF8EIDH), 6, b
#define RXF8EID15                        BANKMASK(RXF8EIDH), 7, b
#define RXF8EID16                        BANKMASK(RXF8SIDL), 0, b
#define RXF8EID17                        BANKMASK(RXF8SIDL), 1, b
#define RXF8EID2                         BANKMASK(RXF8EIDL), 2, b
#define RXF8EID3                         BANKMASK(RXF8EIDL), 3, b
#define RXF8EID4                         BANKMASK(RXF8EIDL), 4, b
#define RXF8EID5                         BANKMASK(RXF8EIDL), 5, b
#define RXF8EID6                         BANKMASK(RXF8EIDL), 6, b
#define RXF8EID7                         BANKMASK(RXF8EIDL), 7, b
#define RXF8EID8                         BANKMASK(RXF8EIDH), 0, b
#define RXF8EID9                         BANKMASK(RXF8EIDH), 1, b
#define RXF8EN                           BANKMASK(RXFCON1), 0, b
#define RXF8EXIDEN                       BANKMASK(RXF8SIDL), 3, b
#define RXF8SID0                         BANKMASK(RXF8SIDL), 5, b
#define RXF8SID1                         BANKMASK(RXF8SIDL), 6, b
#define RXF8SID10                        BANKMASK(RXF8SIDH), 7, b
#define RXF8SID2                         BANKMASK(RXF8SIDL), 7, b
#define RXF8SID3                         BANKMASK(RXF8SIDH), 0, b
#define RXF8SID4                         BANKMASK(RXF8SIDH), 1, b
#define RXF8SID5                         BANKMASK(RXF8SIDH), 2, b
#define RXF8SID6                         BANKMASK(RXF8SIDH), 3, b
#define RXF8SID7                         BANKMASK(RXF8SIDH), 4, b
#define RXF8SID8                         BANKMASK(RXF8SIDH), 5, b
#define RXF8SID9                         BANKMASK(RXF8SIDH), 6, b
#define RXF9EID0                         BANKMASK(RXF9EIDL), 0, b
#define RXF9EID1                         BANKMASK(RXF9EIDL), 1, b
#define RXF9EID10                        BANKMASK(RXF9EIDH), 2, b
#define RXF9EID11                        BANKMASK(RXF9EIDH), 3, b
#define RXF9EID12                        BANKMASK(RXF9EIDH), 4, b
#define RXF9EID13                        BANKMASK(RXF9EIDH), 5, b
#define RXF9EID14                        BANKMASK(RXF9EIDH), 6, b
#define RXF9EID15                        BANKMASK(RXF9EIDH), 7, b
#define RXF9EID16                        BANKMASK(RXF9SIDL), 0, b
#define RXF9EID17                        BANKMASK(RXF9SIDL), 1, b
#define RXF9EID2                         BANKMASK(RXF9EIDL), 2, b
#define RXF9EID3                         BANKMASK(RXF9EIDL), 3, b
#define RXF9EID4                         BANKMASK(RXF9EIDL), 4, b
#define RXF9EID5                         BANKMASK(RXF9EIDL), 5, b
#define RXF9EID6                         BANKMASK(RXF9EIDL), 6, b
#define RXF9EID7                         BANKMASK(RXF9EIDL), 7, b
#define RXF9EID8                         BANKMASK(RXF9EIDH), 0, b
#define RXF9EID9                         BANKMASK(RXF9EIDH), 1, b
#define RXF9EN                           BANKMASK(RXFCON1), 1, b
#define RXF9EXIDEN                       BANKMASK(RXF9SIDL), 3, b
#define RXF9SID0                         BANKMASK(RXF9SIDL), 5, b
#define RXF9SID1                         BANKMASK(RXF9SIDL), 6, b
#define RXF9SID10                        BANKMASK(RXF9SIDH), 7, b
#define RXF9SID2                         BANKMASK(RXF9SIDL), 7, b
#define RXF9SID3                         BANKMASK(RXF9SIDH), 0, b
#define RXF9SID4                         BANKMASK(RXF9SIDH), 1, b
#define RXF9SID5                         BANKMASK(RXF9SIDH), 2, b
#define RXF9SID6                         BANKMASK(RXF9SIDH), 3, b
#define RXF9SID7                         BANKMASK(RXF9SIDH), 4, b
#define RXF9SID8                         BANKMASK(RXF9SIDH), 5, b
#define RXF9SID9                         BANKMASK(RXF9SIDH), 6, b
#define RXM0EID0                         BANKMASK(RXM0EIDL), 0, b
#define RXM0EID1                         BANKMASK(RXM0EIDL), 1, b
#define RXM0EID10                        BANKMASK(RXM0EIDH), 2, b
#define RXM0EID11                        BANKMASK(RXM0EIDH), 3, b
#define RXM0EID12                        BANKMASK(RXM0EIDH), 4, b
#define RXM0EID13                        BANKMASK(RXM0EIDH), 5, b
#define RXM0EID14                        BANKMASK(RXM0EIDH), 6, b
#define RXM0EID15                        BANKMASK(RXM0EIDH), 7, b
#define RXM0EID16                        BANKMASK(RXM0SIDL), 0, b
#define RXM0EID17                        BANKMASK(RXM0SIDL), 1, b
#define RXM0EID2                         BANKMASK(RXM0EIDL), 2, b
#define RXM0EID3                         BANKMASK(RXM0EIDL), 3, b
#define RXM0EID4                         BANKMASK(RXM0EIDL), 4, b
#define RXM0EID5                         BANKMASK(RXM0EIDL), 5, b
#define RXM0EID6                         BANKMASK(RXM0EIDL), 6, b
#define RXM0EID7                         BANKMASK(RXM0EIDL), 7, b
#define RXM0EID8                         BANKMASK(RXM0EIDH), 0, b
#define RXM0EID9                         BANKMASK(RXM0EIDH), 1, b
#define RXM0EXIDM                        BANKMASK(RXM0SIDL), 3, b
#define RXM0SID0                         BANKMASK(RXM0SIDL), 5, b
#define RXM0SID1                         BANKMASK(RXM0SIDL), 6, b
#define RXM0SID10                        BANKMASK(RXM0SIDH), 7, b
#define RXM0SID2                         BANKMASK(RXM0SIDL), 7, b
#define RXM0SID3                         BANKMASK(RXM0SIDH), 0, b
#define RXM0SID4                         BANKMASK(RXM0SIDH), 1, b
#define RXM0SID5                         BANKMASK(RXM0SIDH), 2, b
#define RXM0SID6                         BANKMASK(RXM0SIDH), 3, b
#define RXM0SID7                         BANKMASK(RXM0SIDH), 4, b
#define RXM0SID8                         BANKMASK(RXM0SIDH), 5, b
#define RXM0SID9                         BANKMASK(RXM0SIDH), 6, b
#define RXM1EID0                         BANKMASK(RXM1EIDL), 0, b
#define RXM1EID1                         BANKMASK(RXM1EIDL), 1, b
#define RXM1EID10                        BANKMASK(RXM1EIDH), 2, b
#define RXM1EID11                        BANKMASK(RXM1EIDH), 3, b
#define RXM1EID12                        BANKMASK(RXM1EIDH), 4, b
#define RXM1EID13                        BANKMASK(RXM1EIDH), 5, b
#define RXM1EID14                        BANKMASK(RXM1EIDH), 6, b
#define RXM1EID15                        BANKMASK(RXM1EIDH), 7, b
#define RXM1EID16                        BANKMASK(RXM1SIDL), 0, b
#define RXM1EID17                        BANKMASK(RXM1SIDL), 1, b
#define RXM1EID2                         BANKMASK(RXM1EIDL), 2, b
#define RXM1EID3                         BANKMASK(RXM1EIDL), 3, b
#define RXM1EID4                         BANKMASK(RXM1EIDL), 4, b
#define RXM1EID5                         BANKMASK(RXM1EIDL), 5, b
#define RXM1EID6                         BANKMASK(RXM1EIDL), 6, b
#define RXM1EID7                         BANKMASK(RXM1EIDL), 7, b
#define RXM1EID8                         BANKMASK(RXM1EIDH), 0, b
#define RXM1EID9                         BANKMASK(RXM1EIDH), 1, b
#define RXM1EXIDEN                       BANKMASK(RXM1SIDL), 3, b
#define RXM1SID0                         BANKMASK(RXM1SIDL), 5, b
#define RXM1SID1                         BANKMASK(RXM1SIDL), 6, b
#define RXM1SID10                        BANKMASK(RXM1SIDH), 7, b
#define RXM1SID2                         BANKMASK(RXM1SIDL), 7, b
#define RXM1SID3                         BANKMASK(RXM1SIDH), 0, b
#define RXM1SID4                         BANKMASK(RXM1SIDH), 1, b
#define RXM1SID5                         BANKMASK(RXM1SIDH), 2, b
#define RXM1SID6                         BANKMASK(RXM1SIDH), 3, b
#define RXM1SID7                         BANKMASK(RXM1SIDH), 4, b
#define RXM1SID8                         BANKMASK(RXM1SIDH), 5, b
#define RXM1SID9                         BANKMASK(RXM1SIDH), 6, b
#define RXWARN                           BANKMASK(COMSTAT), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SAM                              BANKMASK(BRGCON2), 6, b
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SEG1PH0                          BANKMASK(BRGCON2), 3, b
#define SEG1PH1                          BANKMASK(BRGCON2), 4, b
#define SEG1PH2                          BANKMASK(BRGCON2), 5, b
#define SEG2PH0                          BANKMASK(BRGCON3), 0, b
#define SEG2PH1                          BANKMASK(BRGCON3), 1, b
#define SEG2PH2                          BANKMASK(BRGCON3), 2, b
#define SEG2PHT                          BANKMASK(BRGCON2), 7, b
#define SEG2PHTS                         BANKMASK(BRGCON2), 7, b
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SJW0                             BANKMASK(BRGCON1), 6, b
#define SJW1                             BANKMASK(BRGCON1), 7, b
#define SLRA                             BANKMASK(SLRCON), 0, a
#define SLRB                             BANKMASK(SLRCON), 1, a
#define SLRC                             BANKMASK(SLRCON), 2, a
#define SLRD                             BANKMASK(SLRCON), 3, a
#define SLRE                             BANKMASK(SLRCON), 4, a
#define SLRF                             BANKMASK(SLRCON), 5, a
#define SLRG                             BANKMASK(SLRCON), 6, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCDRV                          BANKMASK(OSCCON2), 4, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SOSCGO                           BANKMASK(OSCCON2), 3, a
#define SOSCRUN                          BANKMASK(OSCCON2), 6, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SRETEN                           BANKMASK(WDTCON), 4, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPMD                            BANKMASK(PMD0), 0, b
#define SSPOD                            BANKMASK(ODCON), 7, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define STRA                             BANKMASK(PSTR1CON), 0, a
#define STRB                             BANKMASK(PSTR1CON), 1, a
#define STRC                             BANKMASK(PSTR1CON), 2, a
#define STRD                             BANKMASK(PSTR1CON), 3, a
#define STRSYNC                          BANKMASK(PSTR1CON), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_T1DONE                 BANKMASK(T1GCON), 3, a
#define T1GGO_nT1DONE                    BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GCON), 0, a
#define T1GSS1                           BANKMASK(T1GCON), 1, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_T3DONE                 BANKMASK(T3GCON), 3, a
#define T3GGO_nT3DONE                    BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, a
#define T4CKPS1                          BANKMASK(T4CON), 1, a
#define T4OUTPS0                         BANKMASK(T4CON), 3, a
#define T4OUTPS1                         BANKMASK(T4CON), 4, a
#define T4OUTPS2                         BANKMASK(T4CON), 5, a
#define T4OUTPS3                         BANKMASK(T4CON), 6, a
#define TEC0                             BANKMASK(TXERRCNT), 0, b
#define TEC1                             BANKMASK(TXERRCNT), 1, b
#define TEC2                             BANKMASK(TXERRCNT), 2, b
#define TEC3                             BANKMASK(TXERRCNT), 3, b
#define TEC4                             BANKMASK(TXERRCNT), 4, b
#define TEC5                             BANKMASK(TXERRCNT), 5, b
#define TEC6                             BANKMASK(TXERRCNT), 6, b
#define TEC7                             BANKMASK(TXERRCNT), 7, b
#define TGEN                             BANKMASK(CTMUCONH), 4, b
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS0                          BANKMASK(T1CON), 6, a
#define TMR1CS1                          BANKMASK(T1CON), 7, a
#define TMR1GE                           BANKMASK(T1GCON), 7, a
#define TMR1GIE                          BANKMASK(PIE1), 2, a
#define TMR1GIF                          BANKMASK(PIR1), 2, a
#define TMR1GIP                          BANKMASK(IPR1), 2, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS0                          BANKMASK(T3CON), 6, a
#define TMR3CS1                          BANKMASK(T3CON), 7, a
#define TMR3GE                           BANKMASK(T3GCON), 7, a
#define TMR3GIE                          BANKMASK(PIE2), 0, a
#define TMR3GIF                          BANKMASK(PIR2), 0, a
#define TMR3GIP                          BANKMASK(IPR2), 0, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE4), 7, a
#define TMR4IF                           BANKMASK(PIR4), 7, a
#define TMR4IP                           BANKMASK(IPR4), 7, a
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 2, a
#define TO                               BANKMASK(RCON), 3, a
#define TRIGSEL0                         BANKMASK(ADCON1), 6, a
#define TRIGSEL1                         BANKMASK(ADCON1), 7, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRMT2                            BANKMASK(TXSTA2), 1, a
